cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'
tap 'dteoh/sqa' # Slow quit apps tap

brew 'ack'
brew 'coreutils'
brew 'ctags'
brew 'doxygen'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'mackup'
brew 'mas'
brew 'n'
brew 'neovim'
brew 'readline'
brew 'ripgrep'
brew 'postgresql'
brew 'roundup'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'zplug'

# Tmux
brew 'tmux'
brew 'reattach-to-user-namespace'

# Docker
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'xhyve'
brew 'docker-machine-driver-xhyve'


# Java
cask 'java8'
brew 'maven'

# Python
brew 'python@2'
brew 'python@3'
cask 'anaconda'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Fonts
cask 'font-hack'

# Core applications
cask 'hyperdock'
cask 'spectacle'
cask 'alfred'
cask 'google-chrome'
cask 'evernote'
cask 'the-unarchiver'
cask 'flux'
cask 'transmit'
cask 'kindle'
cask 'aerial'
cask 'bartender'
cask 'appcleaner'
cask 'contexts'
cask 'hazel'
cask 'nordvpn'
cask 'bee'
cask 'gifcapture'
cask 'grammarly'
cask 'slowquitapps'

# Design tools
cask 'sketch'
cask 'xscope'
cask 'zeplin'
cask 'invisionsync'

# File storage
cask 'google-drive'

# Chat applications
cask 'yakyak'
cask 'whatsapp'
cask 'slack'
cask 'skype'

# Music applications
cask 'soundcleod'
cask 'radiant-player'
cask 'beardedspice'

# Entertainment applications
cask 'vlc'
cask 'deluge'
cask 'music-manager'
cask 'subtitles'
cask 'plex-media-server'
cask 'google-plus-auto-backup'
cask'jadengeller-helium'

# Developer Applications
cask 'paw'
cask 'charles'
cask 'webstorm'
cask 'firefox'
cask 'iterm2'
cask 'parallels-desktop'
cask 'kaleidoscope'
cask 'dash'
cask 'tower'
cask 'datagrip'
cask 'marked'
cask 'go2shell'
cask 'gitup'

# Mas
mas 'Xcode', id: 497799835
mas 'Fantastical 2', id: 975937182
mas 'Airmail 3', id: 918858936
mas 'Reeder 3', id: 880001334
mas 'Paste – smart clipboard history & snippets manager', id: 967805235
mas 'Noizio', id: 928871589
mas 'HazeOver • Distraction Dimmer', id: 430798174
mas 'SnippetsLab', id: 1006087419
mas 'Battery Monitor - Health, Status and Battery Usage Information', id: 836505650
mas 'Deliveries: a package tracker', id: 924726344
mas 'Be Focused Pro - Focus Timer & Goal Tracker', id: 961632517
mas 'Patterns - The Regex App', id: 429449079
mas 'DaisyDisk', id: 411643860
mas 'Moom', id: 419330170
mas 'ForkLift - File Manager and FTP/SFTP/WebDAV/Amazon S3 client', id: 412448059
mas 'Pixelmator', id: 407963104
mas 'Todoist: To Do List | Task List', id: 585829637
mas 'Amphetamine', id: 937984704
