cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

# Core applications
cask 'hyperdock'
cask 'spectacle'
cask 'alfred'
cask 'google-chrome'
cask 'evernote'
cask 'seil'
cask 'the-unarchiver'
cask 'flux'
cask 'transmit'
cask 'kindle'
cask 'aerial'
cask 'bartender'
cask 'appcleaner'
cask 'contexts'
cask 'hazel'
cask 'istats-menu'
cask 'nordvpn'

# Design tools
cask 'sketch'
cask 'xscope'
cask 'zeplin'
cask 'invisionsync'

# File storage
cask 'google-drive'

# Chat applications
cask 'yakyak'
cask 'whatsapp'
cask 'slack'
cask 'skype'

# Music applications
cask 'soundcleod'
cask 'radiant-player'
cask 'beardedspice'

# Entertainment applications
cask 'vlc'
cask 'deluge'
cask 'music-manager'
cas 'subtitles'
cask 'plex-media-server'
cask 'google-plus-auto-backup'
cask'jadengeller-helium'

# Developer Applications
cask 'paw'
cask 'charles'
cask 'webstorm'
cask 'firefox'
cask 'iterm2'
cask 'parallels-desktop'
cask 'kaleidoscope'
cask 'dash'
cask 'tower'
cask 'datagrip'
cask 'marked'
cask 'go2shell'
cask 'gitup'

